Documents/АР17_Д_ПланПоОбъекту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР17_Д_ПланПоОбъекту</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассПомещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_КлассПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОперДоходОбъекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрДоходВДень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аренда</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрДоходПоАрендеВДень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВонагрождениеУК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТОиЭКУЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧистыйДоход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АР17_Д_ПланПоОбъекту/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТЧМесяцПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Месяц) Тогда
		ТекущиеДанные.Месяц = НачалоМесяца(ТекущиеДанные.Месяц);
		ТекущиеДанные.КоличествоДней = Лев(КонецМесяца(ТекущиеДанные.Месяц),2);
	КонецЕсли;
	ЗаполнитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТЧКНПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	ЗаполнитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТЧОперДоходОбъектаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	ЗаполнитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтроку()
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Месяц) И ЗначениеЗаполнено(ТекущиеДанные.КН) Тогда
		ТекущиеДанные.ОСС = Окр(ТекущиеДанные.КН / ТекущиеДанные.Количестводней * 100,0);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.СрДоходВДень) И ЗначениеЗаполнено(ТекущиеДанные.КН) Тогда
		ТекущиеДанные.ОперДоходОбъекта = Окр(ТекущиеДанные.СрДоходВДень * ТекущиеДанные.КН,0);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.Аренда) И ЗначениеЗаполнено(ТекущиеДанные.КН) Тогда
		ТекущиеДанные.СрДоходПоАрендеВДень = Окр(ТекущиеДанные.Аренда / ТекущиеДанные.КН,0);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.Аренда) Тогда
		ТекущиеДанные.ВонагрождениеУК = Окр(ТекущиеДанные.Аренда * 0.25,0);
	КонецЕсли;
	//Если ЗначениеЗаполнено(ТекущиеДанные.Месяц) Тогда
	//	ТекущиеДанные.ТОиЭКУЗакупки = ПолучитьРасходы(ТекущиеДанные.Месяц,Объект.ИК);
	//КонецЕСли;
	Если ЗначениеЗаполнено(ТекущиеДанные.Аренда) И ЗначениеЗаполнено(ТекущиеДанные.ТОиЭКУЗакупки) Тогда
		ТекущиеДанные.ЧистыйДоход = Окр(ТекущиеДанные.Аренда - ТекущиеДанные.ВонагрождениеУК - ТекущиеДанные.ТОиЭКУЗакупки,0);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРасходы(Месяц, ИК)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(бит_ОборотыПоБюджетамОбороты.СуммаУпрОборот * Д_БазыРаспределенияСрезПоследних.Процент / 100) КАК СуммаУпрОборот
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды.Проекты КАК АР_ОбъектыАрендыПроекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Д_БазыРаспределения.СрезПоследних(&КонецПериода, ) КАК Д_БазыРаспределенияСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	               |					&НачалоПериода,
	               |					&КонецПериода,
	               |					Месяц,
	               |					Сценарий = &Сценарий
	               |						И ЦФО = &ЦФО) КАК бит_ОборотыПоБюджетамОбороты
	               |			ПО (бит_ОборотыПоБюджетамОбороты.ЦФО = Д_БазыРаспределенияСрезПоследних.ЦФО)
	               |				И (бит_ОборотыПоБюджетамОбороты.Проект = Д_БазыРаспределенияСрезПоследних.Проект)
	               |				И (бит_ОборотыПоБюджетамОбороты.СтатьяОборотов = Д_БазыРаспределенияСрезПоследних.Статья)
	               |		ПО АР_ОбъектыАрендыПроекты.Проект = Д_БазыРаспределенияСрезПоследних.Проект
	               |ГДЕ
	               |	Д_БазыРаспределенияСрезПоследних.Распределение = &Распределение
	               |	И АР_ОбъектыАрендыПроекты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(Месяц));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(Месяц));
	Запрос.УстановитьПараметр("Сценарий",Справочники.СценарииПланирования.НайтиПоКоду("00-000002"));
	//Запрос.УстановитьПараметр("Проект",ИК.Проект);
	Запрос.УстановитьПараметр("ЦФО",ИК.ЦФО);
	Запрос.УстановитьПараметр("Ссылка",ИК);
	Запрос.УстановитьПараметр("Распределение","Распределение ЛК");
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез[0].СуммаУпрОборот / ИК.АП;
КонецФункции

&НаКлиенте
Процедура ТЧАрендаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	ЗаполнитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТЧПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		Если ТекущиеДанные.НомерСтроки > 0 Тогда
			Строка = Объект.ТЧ.Добавить();       
			Строка.Месяц = ДобавитьМесяц(Объект.ТЧ[Объект.ТЧ.Количество()-2].Месяц,1);
			Строка.КоличествоДней = Лев(КонецМесяца(Строка.Месяц),2);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧСрДоходВДеньПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	ЗаполнитьСтроку();
КонецПроцедуры
